TestCases/Archive/OpenBubbleEvap/constant/bubbleCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      bubbleCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;  
    coupled         false;                   
    transient       yes;
    cellValueSourceCorrection on;
    maxCo           0.3;

    sourceTerms
    {
        schemes
        {
            U               explicit 1;
        }
    }

    interpolationSchemes                 
        
    {
        rho             cellPoint;
        U               cellPoint;
        mu              cellPoint;
        alpha.liquid    cellPoint;
        T               cellPoint;
        n_hat           cellPoint;
    }

    integrationSchemes
    {
        U               Euler;
    }
}


constantProperties
{
    rho0            8.0;       // HFE-7000 

    constantVolume  false;    

    //Not sure whether alphaMax is actually used anywhere
    alphaMax        0.5; //CHW - Added for determination of alphac in main solver
}


subModels
{
    particleForces
    {
        sphereDrag;
        gravity;
        InterfacePinning;
    }

    injectionModels    
    {
        model1
        {
            type            patchInjection;
            SOI             0.01;
            massTotal       20;
            parcelBasisType fixed;
            nParticle       1;
            patch           Inlet;
            duration        100;
            parcelsPerSecond 5000;
            U0              (0 0.01 0);
            flowRateProfile constant 1;
            sizeDistribution
            {
                type        uniform;
                uniformDistribution
                {
                     minValue       0.0001;
                     maxValue       0.0002;
                }

                /*
                type        fixedValue;
                fixedValueDistribution
                {
                     value       0.004;
                }
                */
            }
        }
    }

    collisionModel none;

    dispersionModel none;     //stochasticDispersionRAS;

    patchInteractionModel standardWallInteraction;

   
    heatTransferModel RanzMarshall;    // Need to be built in ThermalBubbleCloud  
    
       RanzMarshallCoeffs
       {
            BirdCorrection  true;
            a    2.0;                 // Default 
            b    0.6;
            m    0.5;
            n    0.66666;
       } 
       
   
        
    compositionModel singleMixtureFraction;

    phaseChangeModel none;    

    devolatilisationModel none; 

    surfaceReactionModel none; 

    stochasticCollisionModel none; 

    surfaceFilmModel none; 

    radiation       off;  

    standardWallInteractionCoeffs
    {
        type            rebound;
    }

}

cloudFunctions
{
  
}


// ************************************************************************* //
